import sqlite3 as sql
con=sql.connect("works.db")
cur=con.cursor()

cur.execute("""CREATE TABLE  product(
            id_product INTEGER PRIMARY KEY,
            name_product TEXT,
            weight REAL,
            power REAL,
            sector INTEGER
            )""")
tab1=[
    (1, "УПНТА-35", 1.47, 5.2, 10),
    (2, "УПНТА-74-01", 1.14, 4.7, 11),
    (3, "УПНТА-18М", 2.25, 8.4, 11),
    (4, "МАС-30К49", 1.49, 6.1, 10),
    (5, "МАС-04Н", 1.98, 7.2, 11),
    (6, "МАС-1ВБ", 1.71, 6.6, 10),
    (7, "ТБКН-1-4У", 2.14, 8.1, 11),
    (8, "ПВК12-01", 1.65, 5.8, 10),
    (9, "ТТНК63", 1.8, 6.2, 11),
    (10, "КТВ-50-1", 1.52, 5.5, 11)
]
cur.executemany("INSERT INTO product (id_product, name_product, weight, power, sector) values (?, ?, ?, ?, ?)", tab1)

with con:
    cur.execute("""CREATE TABLE module(
                id_module INTEGER,
                name_module TEXT,
                id_product INTEGER,
                capacity INTEGER,
                sector INTEGER,
                PRIMARY KEY(id_module),
                FOREIGN KEY(id_product) REFERENCES product(id_product)
                );""")
tab2=[
    (1, "Лом_БНК.113.001", 1, 2, 7),
    (2, "Лом_БНК.227.886", 5, 2, 6),
    (3, "Лом_БНК.701.549", 9, 1, 7),
    (4, "Лом_БНК.703.555", 8, 1, 7),
    (5, "Станина_СТГ.111.502", 9, 1, 6),
    (6, "Лом_СТГ.000.217", 4, 2, 6),
    (7, "Станина_СТГ.630.992", 10, 1, 6),
    (8, "Корпус_СТГ.700.470", 10, 2, 7),
    (9, "Привод_НАК.894.015", 8, 1, 6),
    (10, "Привод_НАК.305.027", 1, 1, 7),
    (11, "Привод_НАК.517.439", 2, 1, 7),
    (12, "Привод_НАК.144.400", 3, 1, 7),
    (13, "Станина_ГНН.655.895", 6, 1, 7),
    (14, "Привод_ГНН.421.044", 4, 2, 6),
    (15, "Привод_ГНН.817.030", 5, 1, 7),
    (16, "Привод_ГНН.021.003", 7, 1, 7),
    (17, "Привод_ЖВН.467.684", 6, 1, 6),
    (18, "Лом_ЖВН.894.959", 3, 9, 7),
    (19, "Привод_ЖВН.896.447", 7, 1, 6),
    (20, "Лом_ЖВН.340.858", 2, 2, 6)
]

cur.executemany("INSERT INTO module (id_module, name_module, id_product, capacity, sector) values (?, ?, ?, ?, ?)", tab2)

with con:
    cur.execute("""CREATE TABLE component(
                id_component INTEGER,
                name_component TEXT,
                id_module INTEGER,
                id_product INTEGER,
                capacity INTEGER,
                sector INTEGER,
                PRIMARY KEY(id_component),
                FOREIGN KEY(id_product) REFERENCES product(id_product),
                FOREIGN KEY(id_module) REFERENCES module(id_module)
                );""")
tab3=[
    (1, "Трос_АТД.098.576", 2, 5, 1, 12),
    (2, "Винт_АТД.682.295", 3, 9, 8, 22),
    (3, "Вал_АТД.364.619", 3, 9, 2, 4),
    (4, "Барабан_АТД.701.111", 12, 3, 2, 22),
    (5, "Втулка_АТД.929.065", 13, 6, 2, 4),
    (6, "Скребок_АТД.264.904", 3, 9, 1, 3),
    (7, "Двигатель_АТД.990.540", 11, 2, 1, 22),
    (8, "Двигатель_АТД.586.844", 12, 3, 1, 22),
    (9, "Барабан_АТД.247.162", 13, 6, 2, 22),
    (10, "Барабан_АТД.103.359", 14, 4, 4, 22),
    (11, "Шток_АТД.631.828", 19, 7, 2, 4),
    (12, "Двигатель_АТД.424.008", 10, 1, 1, 22),
    (13, "Основание_АТД.938.810", 13, 6, 2, 22),
    (14, "Диск_АТД.269.298", 4, 8, 10, 4),
    (15, "Корпус_АТД.598.675", 3, 9, 2, 8),
    (16, "Кольцо_АТД.291.836", 8, 10, 8, 4),
    (17, "Основание_ВАН.747.777", 1, 1, 1, 3),
    (18, "Шток_ВАН.947.358", 4, 8, 2, 4),
    (19, "Двигатель_ВАН.803.350", 9, 8, 1, 22),
    (20, "Двигатель_ВАН.941.319", 14, 4, 1, 22),
    (21, "Двигатель_ВАН.542.456", 15, 5, 1, 22),
    (22, "Барабан_ВАН.151.078", 10, 1, 4, 22),
    (23, "Барабан_ВАН.335.355", 15, 5, 4, 22),
    (24, "Основание_ВАН.681.206", 5, 9, 1, 4),
    (25, "Корпус_ВАН.290.992", 1, 1, 1, 3),
    (26, "Корпус_ВАН.722.046", 2, 5, 1, 3),
    (27, "Трос_ВАН.492.887", 3, 9, 2, 12),
    (28, "Трос_ВАН.951.914", 4, 8, 3, 12),
    (29, "Корпус_ВАН.001.008", 4, 8, 1, 4),
    (30, "Наконечник_ВАН.903.485", 5, 9, 18, 4),
    (31, "Корпус_ВАН.331.598", 5, 9, 1, 3),
    (32, "Корпус_ДГШ.986.798", 8, 10, 1, 3),
    (33, "Втулка_ДГШ.420.608", 9, 8, 6, 4),
    (34, "Трубка_ДГШ.057.921", 14, 4, 6, 4),
    (35, "Скребок_ДГШ.329.308", 4, 8, 4, 3),
    (36, "Кронштейн_ДГШ.712.665", 11, 2, 3, 3),
    (37, "Кронштейн_ДГШ.256.979", 12, 3, 6, 4),
    (38, "Трубка_ДГШ.787.101", 12, 3, 8, 4),
    (39, "Трубка_ДГШ.371.886", 15, 5, 8, 4),
    (40, "Корпус_ДГШ.060.625", 6, 4, 1, 8),
    (41, "Шкив_ДГШ.297.170", 2, 5, 1, 8),
    (42, "Основание_ДГШ.611.933", 7, 10, 2, 22),
    (43, "Кольцо_ДГШ.832.183", 6, 4, 3, 4),
    (44, "Винт_ДГШ.708.890", 7, 10, 4, 22),
    (45, "Скребок_НТК.313.648", 1, 1, 6, 3),
    (46, "Корпус_НТК.711.395", 9, 8, 2, 3),
    (47, "Корпус_НТК.835.064", 20, 2, 2, 3),
    (48, "Шкив_НТК.185.837", 11, 2, 2, 8),
    (49, "Гайка_НТК.193.152", 15, 5, 36, 22),
    (50, "Кронштейн_НТК.200.594", 14, 4, 1, 3),
    (51, "Маховик_НТК.740.961", 10, 1, 3, 8),
    (52, "Гайка_НТК.284.291", 17, 6, 15, 22),
    (53, "Кольцо_НТК.606.910", 11, 2, 8, 4),
    (54, "Двигатель_НТК.579.840", 17, 6, 2, 22),
    (55, "Кронштейн_НТК.194.585", 20, 2, 2, 4),
    (56, "Кронштейн_НТК.000.305", 15, 5, 2, 3),
    (57, "Двигатель_НТК.752.070", 19, 7, 1, 22),
    (58, "Винт_НТК.183.564", 8, 10, 18, 22),
    (59, "Вал_УСТ.783.980", 7, 10, 2, 4),
    (60, "Двигатель_УСТ.432.468", 16, 7, 2, 22),
    (61, "Шкив_УСТ.469.499", 16, 7, 4, 8),
    (62, "Шкив_УСТ.596.997", 19, 7, 6, 8),
    (63, "Скребок_УСТ.158.063", 2, 5, 4, 3),
    (64, "Скребок_УСТ.015.581", 6, 4, 4, 3),
    (65, "Скребок_УСТ.786.309", 19, 7, 2, 3),
    (66, "Маховик_УСТ.319.184", 12, 3, 1, 8),
    (67, "Маховик_УСТ.629.478", 16, 7, 2, 8),
    (68, "Корпус_УСТ.026.623", 18, 3, 1, 4),
    (69, "Скребок_УСТ.724.598", 18, 3, 2, 3),
    (70, "Шкив_УСТ.200.853", 6, 4, 3, 8)
]

cur.executemany("INSERT INTO component (id_component, name_component, id_module, id_product, capacity, sector) values (?, ?, ?, ?, ?, ?)", tab3)
con.commit()

con.close()